# Cleaning Data

**Outcomes**

- Be able to use string methods to clean data that comes as a string  
- Be able to drop missing data  
- Use cleaning methods to prepare and analyze a real dataset  

**Data**

- Item information from about 3,000 Chipotle meals from about 1,800
  Grubhub orders

In [1]:
import numpy as np
import pandas as pd
import qeds

## Cleaning Data

For many data projects, a [significant proportion of
time](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#74d447456f63)
is spent collecting and cleaning the data — not performing the analysis.

This non-analysis work is often called “data cleaning”.

pandas provides very powerful data cleaning tools, which we
will demonstrate using the following dataset.

In [2]:
df = pd.DataFrame({"numbers": ["#23", "#24", "#18", "#14", "#12", "#10", "#35"],
                   "nums": ["23", "24", "18", "14", np.nan, "XYZ", "35"],
                   "colors": ["green", "red", "yellow", "orange", "purple", "blue", "pink"],
                   "other_column": [0, 1, 0, 2, 1, 0, 2]})
df

  numbers nums  colors  other_column
0     #23   23   green             0
1     #24   24     red             1
2     #18   18  yellow             0
3     #14   14  orange             2
4     #12  NaN  purple             1
5     #10  XYZ    blue             0
6     #35   35    pink             2

What would happen if we wanted to try and compute the mean of
`numbers`?

In [3]:
df["numbers"].mean()

TypeError: Could not convert #23#24#18#14#12#10#35 to numeric

In [4]:
df.dtypes

numbers         object
nums            object
colors          object
other_column     int64
dtype: object

It throws an error!

Can you figure out why?

Hint: When looking at error messages, start at the very
bottom.

The final error says, `TypeError: Could not convert #23#24... to numeric`.

## String Methods

Our solution to the previous exercise was to remove the `#` by using
the `replace` string method: `int(c2n.replace("#", ""))`.

One way to make this change to every element of a column would be to
loop through all elements of the column and apply the desired string
methods…

In [5]:
%%time

# Iterate over all rows
for row in df.iterrows():

    # `iterrows` method produces a tuple with two elements...
    # The first element is an index and the second is a Series with the data from that row
    index_value, column_values = row

    # Apply string method
    clean_number = int(column_values["numbers"].replace("#", ""))

    # The `at` method is very similar to the `loc` method, but it is specialized
    # for accessing single elements at a time... We wanted to use it here to give
    # the loop the best chance to beat a faster method which we show you next.
    df.at[index_value, "numbers_loop"] = clean_number

CPU times: user 1.77 ms, sys: 0 ns, total: 1.77 ms
Wall time: 1.69 ms

While this is fast for a small dataset like this, this method slows for larger datasets.

One *significantly* faster (and easier) method is to apply a string
method to an entire column of data.

Most methods that are available to a Python string (we learned a
few of them in the [strings lecture](../python_fundamentals/basics.ipynb)) are
also available to a pandas Series that has `dtype` object.

We access them by doing `s.str.method_name` where `method_name` is
the name of the method.

When we apply the method to a Series, it is applied to all rows in the
Series in one shot!

Let’s redo our previous example using a pandas `.str` method.

In [6]:
df["numbers"]

0    #23
1    #24
2    #18
3    #14
4    #12
5    #10
6    #35
Name: numbers, dtype: object

In [7]:
%%time

# ~2x faster than loop... However, speed gain increases with size of DataFrame. The
# speedup can be in the ballpark of ~100-500x faster for big DataFrames.
# See appendix at the end of the lecture for an application on a larger DataFrame
df["numbers_str"] = df["numbers"].str.replace("#", "")

CPU times: user 898 µs, sys: 77 µs, total: 975 µs
Wall time: 942 µs

In [12]:
df["numbers_str"].dtype

dtype('O')

We can use `.str` to access almost any string method that works on
normal strings. (See the [official
documentation](https://pandas.pydata.org/pandas-docs/stable/text.html)
for more information.)

In [8]:
df["colors"].str.contains("p")

0    False
1    False
2    False
3    False
4     True
5    False
6     True
Name: colors, dtype: bool

In [9]:
df.loc[df["colors"].str.contains("p")]

  numbers nums  colors  other_column  numbers_loop numbers_str
4     #12  NaN  purple             1          12.0          12
6     #35   35    pink             2          35.0          35

In [11]:
df["colors"].str.upper()

0     GREEN
1       RED
2    YELLOW
3    ORANGE
4    PURPLE
5      BLUE
6      PINK
Name: colors, dtype: object

In [10]:
df["colors"].str.capitalize()

0     Green
1       Red
2    Yellow
3    Orange
4    Purple
5      Blue
6      Pink
Name: colors, dtype: object

## Type Conversions

In our example above, the `dtype` of the `numbers_str` column shows that pandas still treats
it as a string even after we have removed the `"#"`.

We need to convert this column to numbers.

The best way to do this is using the `pd.to_numeric` function.

This method attempts to convert whatever is stored in a Series into
numeric values

For example, after the `"#"` removed, the numbers of column
`"numbers"` are ready to be converted to actual numbers.

In [13]:
df["numbers_numeric"] = pd.to_numeric(df["numbers_str"])

In [14]:
df.dtypes

numbers             object
nums                object
colors              object
other_column         int64
numbers_loop       float64
numbers_str         object
numbers_numeric      int64
dtype: object

In [15]:
df.head()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
4,#12,NaN,purple,1,12.0,12,12

We can convert to other types well.

Using the `astype` method, we can convert to any of the supported
pandas `dtypes`.

Below are some examples. (Pay attention to the reported `dtype`)

In [16]:
df["numbers_numeric"].astype(str)

0    23
1    24
2    18
3    14
4    12
5    10
6    35
Name: numbers_numeric, dtype: object

In [17]:
df["numbers_numeric"].astype(float)

0    23.0
1    24.0
2    18.0
3    14.0
4    12.0
5    10.0
6    35.0
Name: numbers_numeric, dtype: float64

**Exercise**

Convert the column `"nums"` to a numeric type using `pd.to_numeric` and
save it to the DataFrame as `"nums_tonumeric"`.

Notice that there is a missing value, and a value that is not a number.

Look at the documentation for `pd.to_numeric` and think about how to
overcome this.

Think about why this could be a bad idea of used without
knowing what your data looks like. (Think about what happens when you
apply it to the `"numbers"` column before replacing the `"#"`.)

In [30]:
pd.to_numeric(df["numbers"], errors="coerce")

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
Name: numbers, dtype: float64

In [27]:
df["nums"]

pd.to_numeric(df["nums"], errors="coerce")
# pd.to_numeric(df["nums"], errors="raise")
# pd.to_numeric(df["nums"], errors="ignore")

0    23.0
1    24.0
2    18.0
3    14.0
4     NaN
5     NaN
6    35.0
Name: nums, dtype: float64

## Missing Data

Many datasets have missing data.

In our example, we are missing an element from the `"nums"` column.

In [31]:
df

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
4,#12,NaN,purple,1,12.0,12,12
5,#10,XYZ,blue,0,10.0,10,10
6,#35,35,pink,2,35.0,35,35

We can find missing data by using the `isnull` method.

In [32]:
df.isnull()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,True,False,False,False,False,False
5,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False

We might want to know whether particular rows or columns have any
missing data.

To do this we can use the `.any` method on the boolean DataFrame
`df.isnull()`.

In [33]:
df.isnull().any(axis=0)

numbers            False
nums                True
colors             False
other_column       False
numbers_loop       False
numbers_str        False
numbers_numeric    False
dtype: bool

In [35]:
df.isnull().any(axis=1)
# df.isnull().any(axis="columns")

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

Many approaches have been developed to deal with missing data, but the two most commonly used (and the corresponding DataFrame method) are:

- Exclusion: Ignore any data that is missing (`.dropna`).  
- Imputation: Compute “predicted” values for the data that is missing
  (`.fillna`).  


For the advantages and disadvantages of these (and other) approaches,
consider reading the [Wikipedia
article](https://en.wikipedia.org/wiki/Missing_data).

For now, let’s see some examples.

In [36]:
# drop all rows containing a missing observation
df.dropna()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
5,#10,XYZ,blue,0,10.0,10,10
6,#35,35,pink,2,35.0,35,35

In [37]:
df.dropna?

In [38]:
df.dropna(axis="columns")

  numbers  colors  other_column  numbers_loop numbers_str  numbers_numeric
0     #23   green             0          23.0          23               23
1     #24     red             1          24.0          24               24
2     #18  yellow             0          18.0          18               18
3     #14  orange             2          14.0          14               14
4     #12  purple             1          12.0          12               12
5     #10    blue             0          10.0          10               10
6     #35    pink             2          35.0          35               35

In [39]:
# fill the missing values with a specific value
df.fillna(value=100)

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
4,#12,100,purple,1,12.0,12,12
5,#10,XYZ,blue,0,10.0,10,10
6,#35,35,pink,2,35.0,35,35

In [40]:
# use the _next_ valid observation to fill the missing data
df.fillna(method="bfill")

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
4,#12,XYZ,purple,1,12.0,12,12
5,#10,XYZ,blue,0,10.0,10,10
6,#35,35,pink,2,35.0,35,35

In [41]:
# use the _previous_ valid observation to fill missing data
df.fillna(method="ffill")

,numbers,nums,colors,other_column,numbers_loop,numbers_str,numbers_numeric
0,#23,23,green,0,23.0,23,23
1,#24,24,red,1,24.0,24,24
2,#18,18,yellow,0,18.0,18,18
3,#14,14,orange,2,14.0,14,14
4,#12,14,purple,1,12.0,12,12
5,#10,XYZ,blue,0,10.0,10,10
6,#35,35,pink,2,35.0,35,35

We will see more examples of dealing with missing data in future
chapters.

## Case Study

We will now use data from an
[article](https://www.nytimes.com/interactive/2015/02/17/upshot/what-do-people-actually-order-at-chipotle.html)
written by The Upshot at the NYTimes.

This data has order information from almost 2,000 Chipotle orders and
includes information on what was ordered and how much it cost.

In [42]:
chipotle = qeds.data.load("chipotle_raw")
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [45]:
chipotle["price"] = pd.to_numeric(chipotle["item_price"].str.replace("$", ""))

<ipython-input-45-181862fd6196>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chipotle["price"] = pd.to_numeric(chipotle["item_price"].str.replace("$", ""))

In [49]:
chipotle["per_unit_price"] = chipotle["price"] / chipotle["quantity"]

In [50]:
chipotle

,order_id,quantity,item_name,choice_description,item_price,price,per_unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,8.49
...,...,...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75,11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75,11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25,11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75,8.75

In [47]:
chipotle.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price             object
price                 float64
dtype: object

In [43]:
chipotle.loc[4, "choice_description"]

'[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]'

**Exercise**

We'd like you to use this data to answer the following questions.

- What is the average price of an item with chicken?  
- What is the average price of an item with steak?  
- Did chicken or steak produce more revenue (total)?  
- How many missing items are there in this dataset? How many missing
  items in each column?  


Hint: before you will be able to do any of these things you will need to
make sure the `item_price` column has a numeric `dtype` (probably
float)

In [56]:
chicken_idx = chipotle["item_name"].str.contains("Chicken")
chicken_price = chipotle.loc[chicken_idx, "per_unit_price"].mean()

steak_idx = chipotle["item_name"].str.contains("Steak")
steak_price = chipotle.loc[steak_idx, "per_unit_price"].mean()

In [57]:
print(f"Average price for item with chicken is {chicken_price}")
print(f"Average price for item with steak is {steak_price}")

Average price for item with chicken is 9.571519230769185
Average price for item with steak is 10.067336182336144

In [58]:
chicken_price < steak_price

True

In [62]:
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price,price,per_unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,8.49

In [72]:
chipotle["quantity"] * chipotle["per_unit_price"]

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Length: 4622, dtype: float64

In [74]:
# Only works with column names from chipotle
# https://pandas.pydata.org/docs/reference/api/pandas.eval.html
chipotle["revenue"] = chipotle.eval("quantity * per_unit_price")

In [64]:
chicken_revenue = chipotle.loc[chicken_idx, "revenue"].sum()
steak_revenue = chipotle.loc[steak_idx, "revenue"].sum()

In [65]:
print(f"Total revenue from items with chicken is {chicken_revenue}")
print(f"Total revenue from items with steak is {steak_revenue}")

Total revenue from items with chicken is 15808.61
Total revenue from items with steak is 7384.26

In [67]:
chipotle.isnull().sum(axis="index")

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
price                    0
per_unit_price           0
revenue                  0
dtype: int64

## Appendix: Performance of `.str` Methods

Let’s repeat the “remove the `#`” example from above, but this time on
a much larger dataset.

In [68]:
import numpy as np

test = pd.DataFrame({"floats": np.round(100*np.random.rand(100_000), 2)})
test["strings"] = test["floats"].astype(str) + "%"
test.head()

   floats strings
0   71.15  71.15%
1   23.21  23.21%
2   49.59  49.59%
3    4.13   4.13%
4   76.52  76.52%

In [69]:
%%time

for row in test.iterrows():
    index_value, column_values = row
    clean_number = column_values["strings"].replace("%", "")
    test.at[index_value, "numbers_loop"] = clean_number

CPU times: user 6.27 s, sys: 0 ns, total: 6.27 s
Wall time: 6.28 s

In [70]:
%%time
test["numbers_str_method"] = test["strings"].str.replace("%", "")

CPU times: user 37.8 ms, sys: 1.17 ms, total: 39 ms
Wall time: 38.3 ms

In [71]:
test["numbers_str_method"].equals(test["numbers_loop"])

True

We got the exact same result in a fraction of the time!

In [75]:
import sys

In [80]:
sys.maxsize > 2**32

True

In [77]:
sys.version

'3.8.8 (default, Feb 24 2021, 21:46:12) \n[GCC 7.3.0]'

In [76]:
sys.version_info

sys.version_info(major=3, minor=8, micro=8, releaselevel='final', serial=0)